import cv2
import numpy as np

# ===== 你点的12个像素点（替换这里）=====
img_pts = np.array([
        # 第1列（x≈690）从下到上
    [690, 1188],
    [691, 998],
    [695, 801],
    [690, 606],

    # 第2列（x≈886）
    [886, 1191],
    [888, 995],
    [890, 803],
    [888, 610],

    # 第3列（x≈1081）
    [1081, 1191],
    [1081, 1000],
    [1081, 803],
    [1085, 610],

    # 第4列（x≈1275）
    [1275, 1193],
    [1278, 1001],
    [1276, 806],
    [1278, 610],
    ], dtype=np.float32)

# ===== 对应真实坐标（单位：cm）=====
world_pts = np.array([
    [0, 0, 0],
    [0, 4, 0],
    [0, 8, 0],
    [0, 12, 0],

    [4, 0, 0],
    [4, 4, 0],
    [4, 8, 0],
    [4, 12, 0],

    [8, 0, 0],
    [8, 4, 0],
    [8, 8, 0],
    [8, 12, 0],

    [12, 0, 0],
    [12, 4, 0],
    [12, 8, 0],
    [12, 12, 0],
], dtype=np.float32)

H, _ = cv2.findHomography(img_pts, world_pts)

print("Homography matrix:")
print(H)

np.save("H_matrix.npy", H)